ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/device/sys/adi_ADuCM4050_device.h
/*!@}*/

/** @defgroup UART  (UART) Module
 *  
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_UART_TypeDef
 *  \brief  
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_TypeDef__
typedef struct _ADI_UART_TypeDef
{
    union {
    __I __C  uint16_t   RX;                            /*!< Receive Buffer Register */
    __O      uint16_t   TX;                            /*!< Transmit Holding Register */
    };
    __I __C  uint8_t  RESERVED0[2];
    __IO     uint16_t   IEN;                           /*!< Interrupt Enable */
    __I __C  uint8_t  RESERVED1[2];
    __I __C  uint16_t   IIR;                           /*!< Interrupt ID */
    __I __C  uint8_t  RESERVED2[2];
    __IO     uint16_t   LCR;                           /*!< Line Control */
    __I __C  uint8_t  RESERVED3[2];
    __IO     uint16_t   MCR;                           /*!< Modem Control */
    __I __C  uint8_t  RESERVED4[2];
    __I __C  uint16_t   LSR;                           /*!< Line Status */
    __I __C  uint8_t  RESERVED5[2];
    __I __C  uint16_t   MSR;                           /*!< Modem Status */
    __I __C  uint8_t  RESERVED6[2];
    __IO     uint16_t   SCR;                           /*!< Scratch Buffer */
    __I __C  uint8_t  RESERVED7[2];
    __IO     uint16_t   FCR;                           /*!< FIFO Control */
    __I __C  uint8_t  RESERVED8[2];
    __IO     uint16_t   FBR;                           /*!< Fractional Baud Rate */
    __I __C  uint8_t  RESERVED9[2];
    __IO     uint16_t   DIV;                           /*!< Baudrate Divider */
    __I __C  uint8_t  RESERVED10[2];
    __IO     uint16_t   LCR2;                          /*!< Second Line Control */
    __I __C  uint8_t  RESERVED11[2];
    __IO     uint16_t   CTL;                           /*!< UART Control Register */
    __I __C  uint8_t  RESERVED12[2];
    __I __C  uint16_t   RFC;                           /*!< RX FIFO Byte Count */
    __I __C  uint8_t  RESERVED13[2];
    __I __C  uint16_t   TFC;                           /*!< TX FIFO Byte Count */
    __I __C  uint8_t  RESERVED14[2];
    __IO     uint16_t   RSC;                           /*!< RS485 Half-duplex Control */
    __I __C  uint8_t  RESERVED15[2];
    __IO     uint16_t   ACR;                           /*!< Auto Baud Control */
    __I __C  uint8_t  RESERVED16[2];
    __I __C  uint16_t   ASRL;                          /*!< Auto Baud Status (Low) */
    __I __C  uint8_t  RESERVED17[2];
    __I __C  uint16_t   ASRH;                          /*!< Auto Baud Status (High) */
} ADI_UART_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_TypeDef__ */

/*!@}*/

/** @defgroup BEEP Beeper Driver (BEEP) Module
 *  Beeper Driver
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_BEEP_TypeDef
 *  \brief  Beeper Driver
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_BEEP_TypeDef__
typedef struct _ADI_BEEP_TypeDef
{
    __IO     uint16_t   CFG;                           /*!< Beeper configuration */
    __I __C  uint8_t  RESERVED0[2];
    __IO     uint16_t   STAT;                          /*!< Beeper status */
    __I __C  uint8_t  RESERVED1[2];
    __IO     uint16_t   TONEA;                         /*!< Tone A Data */
    __I __C  uint8_t  RESERVED2[2];
    __IO     uint16_t   TONEB;                         /*!< Tone B Data */
} ADI_BEEP_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_BEEP_TypeDef__ */

/*!@}*/

/** @defgroup ADC  (ADC) Module
 *  
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_ADC_TypeDef
 *  \brief  
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ADC_TypeDef__
typedef struct _ADI_ADC_TypeDef
{
    __IO     uint16_t   CFG;                           /*!< ADC Configuration */
    __I __C  uint8_t  RESERVED0[2];
    __IO     uint16_t   PWRUP;                         /*!< ADC Power-up Time */
    __I __C  uint8_t  RESERVED1[2];
    __IO     uint16_t   CAL_WORD;                      /*!< Calibration Word */
    __I __C  uint8_t  RESERVED2[2];
    __IO     uint16_t   CNV_CFG;                       /*!< ADC Conversion Configuration */
    __I __C  uint8_t  RESERVED3[2];
    __IO     uint16_t   CNV_TIME;                      /*!< ADC Conversion Time */
    __I __C  uint8_t  RESERVED4[2];
    __IO     uint16_t   AVG_CFG;                       /*!< Averaging Configuration */
    __I __C  uint8_t  RESERVED5[10];
    __IO     uint16_t   IRQ_EN;                        /*!< Interrupt Enable */
    __I __C  uint8_t  RESERVED6[2];
    __IO     uint16_t   STAT;                          /*!< ADC Status */
    __I __C  uint8_t  RESERVED7[2];
    __IO     uint16_t   OVF;                           /*!< Overflow of Output Registers */
    __I __C  uint8_t  RESERVED8[2];
    __IO     uint16_t   ALERT;                         /*!< Alert Indication */
    __I __C  uint8_t  RESERVED9[2];
    __I __C  uint16_t   CH0_OUT;                       /*!< Conversion Result Ch0 */
    __I __C  uint8_t  RESERVED10[2];
    __I __C  uint16_t   CH1_OUT;                       /*!< Conversion Result Ch1 */
    __I __C  uint8_t  RESERVED11[2];
    __I __C  uint16_t   CH2_OUT;                       /*!< Conversion Result Ch2 */
    __I __C  uint8_t  RESERVED12[2];
    __I __C  uint16_t   CH3_OUT;                       /*!< Conversion Result Ch3 */
    __I __C  uint8_t  RESERVED13[2];
    __I __C  uint16_t   CH4_OUT;                       /*!< Conversion Result Ch4 */
    __I __C  uint8_t  RESERVED14[2];
    __I __C  uint16_t   CH5_OUT;                       /*!< Conversion Result Ch5 */
    __I __C  uint8_t  RESERVED15[2];
    __I __C  uint16_t   CH6_OUT;                       /*!< Conversion Result Ch6 */
    __I __C  uint8_t  RESERVED16[2];
    __I __C  uint16_t   CH7_OUT;                       /*!< Conversion Result Ch7 */
    __I __C  uint8_t  RESERVED17[2];
    __I __C  uint16_t   BAT_OUT;                       /*!< Battery Monitoring Result */
    __I __C  uint8_t  RESERVED18[2];
    __I __C  uint16_t   TMP_OUT;                       /*!< Temperature Result */
    __I __C  uint8_t  RESERVED19[2];
    __I __C  uint16_t   TMP2_OUT;                      /*!< Temperature Result 2 */
    __I __C  uint8_t  RESERVED20[2];
    __I __C  uint16_t   DMA_OUT;                       /*!< DMA Output Register */
    __I __C  uint8_t  RESERVED21[2];
    __IO     uint16_t   LIM0_LO;                       /*!< Channel 0 Low Limit */
    __I __C  uint8_t  RESERVED22[2];
    __IO     uint16_t   LIM0_HI;                       /*!< Channel 0 High Limit */
    __I __C  uint8_t  RESERVED23[2];
    __IO     uint16_t   HYS0;                          /*!< Channel 0 Hysteresis */
    __I __C  uint8_t  RESERVED24[6];
    __IO     uint16_t   LIM1_LO;                       /*!< Channel 1 Low Limit */
    __I __C  uint8_t  RESERVED25[2];
    __IO     uint16_t   LIM1_HI;                       /*!< Channel 1 High Limit */
    __I __C  uint8_t  RESERVED26[2];
    __IO     uint16_t   HYS1;                          /*!< Channel 1 Hysteresis */
    __I __C  uint8_t  RESERVED27[6];
    __IO     uint16_t   LIM2_LO;                       /*!< Channel 2 Low Limit */
    __I __C  uint8_t  RESERVED28[2];
    __IO     uint16_t   LIM2_HI;                       /*!< Channel 2 High Limit */
    __I __C  uint8_t  RESERVED29[2];
    __IO     uint16_t   HYS2;                          /*!< Channel 2 Hysteresis */
    __I __C  uint8_t  RESERVED30[6];
    __IO     uint16_t   LIM3_LO;                       /*!< Channel 3 Low Limit */
    __I __C  uint8_t  RESERVED31[2];
    __IO     uint16_t   LIM3_HI;                       /*!< Channel 3 High Limit */
    __I __C  uint8_t  RESERVED32[2];
    __IO     uint16_t   HYS3;                          /*!< Channel 3 Hysteresis */
    __I __C  uint8_t  RESERVED33[38];
    __IO     uint16_t   CFG1;                          /*!< Reference Buffer Low Power Mode */
    __I __C  uint8_t  RESERVED34[576];
} ADI_ADC_TypeDef;
