ARMmbed/mbed-os/targets/TARGET_Analog_Devices/TARGET_ADUCM4X50/TARGET_ADUCM4050/device/sys/adi_ADuCM4050_device.h
typedef enum
{
  RESET_IRQn                     =   -15,    /*!< Cortex-M4 Reset */
  NonMaskableInt_IRQn            =   -14,    /*!< Cortex-M4 Non-maskable Interrupt */
  HardFault_IRQn                 =   -13,    /*!< Cortex-M4 Hardware Fault */
  MemoryManagement_IRQn          =   -12,    /*!< Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn                  =   -11,    /*!< Cortex-M4 Bus Fault */
  UsageFault_IRQn                =   -10,    /*!< Cortex-M4 Usage Fault */
  SVCall_IRQn                    =    -5,    /*!< Cortex-M4 SVCall Interrupt */
  DebugMonitor_IRQn              =    -4,    /*!< Cortex-M4 Debug Monitor */
  PendSV_IRQn                    =    -2,    /*!< Cortex-M4 PendSV Interrupt */
  SysTick_IRQn                   =    -1,    /*!< Cortex-M4 SysTick Interrupt */
  RTC1_EVT_IRQn                  =     0,    /*!< Event */
  XINT_EVT0_IRQn                 =     1,    /*!< External Wakeup Interrupt n */
  XINT_EVT1_IRQn                 =     2,    /*!< External Wakeup Interrupt n */
  XINT_EVT2_IRQn                 =     3,    /*!< External Wakeup Interrupt n */
  XINT_EVT3_IRQn                 =     4,    /*!< External Wakeup Interrupt n */
  WDT_EXP_IRQn                   =     5,    /*!< Expiration */
  PMG0_VREG_OVR_IRQn             =     6,    /*!< Voltage Regulator (VREG) Overvoltage */
  PMG0_BATT_RANGE_IRQn           =     7,    /*!< Battery Voltage (VBAT) Out of Range */
  RTC0_EVT_IRQn                  =     8,    /*!< Event */
  SYS_GPIO_INTA_IRQn             =     9,    /*!< GPIO Interrupt A */
  SYS_GPIO_INTB_IRQn             =    10,    /*!< GPIO Interrupt B */
  TMR0_EVT_IRQn                  =    11,    /*!< Event */
  TMR1_EVT_IRQn                  =    12,    /*!< Event */
  FLCC_EVT_IRQn                  =    13,    /*!< Event */
  UART0_EVTn_IRQn                =    14,    /*!< Event */
  SPI0_EVT_IRQn                  =    15,    /*!< Event */
  SPI2_EVT_IRQn                  =    16,    /*!< Event */
  I2C_SLV_EVT_IRQn               =    17,    /*!< Slave Event */
  I2C_MST_EVT_IRQn               =    18,    /*!< Master Event */
  DMA_CHAN_ERR_IRQn              =    19,    /*!< Channel Error */
  DMA0_CH0_DONE_IRQn             =    20,    /*!< Channel 0 Done */
  DMA0_CH1_DONE_IRQn             =    21,    /*!< Channel 1 Done */
  DMA0_CH2_DONE_IRQn             =    22,    /*!< Channel 2 Done */
  DMA0_CH3_DONE_IRQn             =    23,    /*!< Channel 3 Done */
  DMA0_CH4_DONE_IRQn             =    24,    /*!< Channel 4 Done */
  DMA0_CH5_DONE_IRQn             =    25,    /*!< Channel 5 Done */
  DMA0_CH6_DONE_IRQn             =    26,    /*!< Channel 6 Done */
  DMA0_CH7_DONE_IRQn             =    27,    /*!< Channel 7 Done */
  DMA0_CH8_DONE_IRQn             =    28,    /*!< Channel 8 Done */
  DMA0_CH9_DONE_IRQn             =    29,    /*!< Channel 9 Done */
  DMA0_CH10_DONE_IRQn            =    30,    /*!< Channel 10 Done */
  DMA0_CH11_DONE_IRQn            =    31,    /*!< Channel 11 Done */
  DMA0_CH12_DONE_IRQn            =    32,    /*!< Channel 12 Done */
  DMA0_CH13_DONE_IRQn            =    33,    /*!< Channel 13 Done */
  DMA0_CH14_DONE_IRQn            =    34,    /*!< Channel 14 Done */
  DMA0_CH15_DONE_IRQn            =    35,    /*!< Channel 15 Done */
  SPORT_A_EVT_IRQn               =    36,    /*!< Channel A Event */
  SPORT_B_EVT_IRQn               =    37,    /*!< Channel B Event */
  CRYPT_EVT_IRQn                 =    38,    /*!< Event */
  DMA0_CH24_DONE_IRQn            =    39,    /*!< Channel 24 Done */
  TMR2_EVT_IRQn                  =    40,    /*!< Event */
  CLKG_XTAL_OSC_EVT_IRQn         =    41,    /*!< Crystal Oscillator Event */
  SPI1_EVT_IRQn                  =    42,    /*!< Event */
  CLKG_PLL_EVT_IRQn              =    43,    /*!< PLL Event */
  RNG0_EVT_IRQn                  =    44,    /*!< Event */
  BEEP_EVT_IRQn                  =    45,    /*!< Event */
  DMA0_CH16_DONE_IRQn            =    56,    /*!< Channel 16 Done */
  DMA0_CH17_DONE_IRQn            =    57,    /*!< Channel 17 Done */
  DMA0_CH18_DONE_IRQn            =    58,    /*!< Channel 18 Done */
  DMA0_CH19_DONE_IRQn            =    59,    /*!< Channel 19 Done */
  DMA0_CH20_DONE_IRQn            =    60,    /*!< Channel 20 Done */
  DMA0_CH21_DONE_IRQn            =    61,    /*!< Channel 21 Done */
  DMA0_CH22_DONE_IRQn            =    62,    /*!< Channel 22 Done */
  DMA0_CH23_DONE_IRQn            =    63,    /*!< Channel 23 Done */
  UART1_EVTn_IRQn                =    66,    /*!< Event */
  DMA0_CH25_DONE_IRQn            =    67,    /*!< Channel 25 Done */
  DMA0_CH26_DONE_IRQn            =    68,    /*!< Channel 26 Done */
  TMR_RGB_EVT_IRQn               =    69,    /*!< Event */
  CLKG_ROOTCLK_ERR_IRQn          =    71,    /*!< Root Clock Error */
} IRQn_Type;  /* typedef name for fixed interrupt numbers */
#endif /* !__ADI_NO_DECL_ENUM_IRQn_Type__ */



#if defined (_MISRA_RULES)
#pragma diag(pop)
#endif /* _MISRA_RULES */


#if defined (__CC_ARM)
#pragma pop
#endif 

#endif
